app/app/controllers/spdx_docs_controller.rb

SELECT `spdx_docs`.* FROM `spdx_docs`
---
  def index
    @spdx_docs = SpdxDoc.all

SELECT `spdx_docs`.* FROM `spdx_docs` WHERE `spdx_docs`.`id` = 1 LIMIT 1
---
  def show
    @spdx_doc = SpdxDoc.find(params[:id])

SELECT `spdx_docs`.* FROM `spdx_docs` WHERE `spdx_docs`.`id` = 1 LIMIT 1
---
  def edit
    @spdx_doc = SpdxDoc.find(params[:id])

INSERT INTO `spdx_docs` (`comment_id`, `created_at`, `data_license`, `spec_version`, `updated_at`) VALUES (NULL, '2013-03-04 20:42:27', NULL, '1.2.3.4', '2013-03-04 20:42:27')
---
  def create
    @spdx_doc = SpdxDoc.new(params[:spdx_doc])

    respond_to do |format|
      if @spdx_doc.save